"""
Дана стандартная колода карт. Напишите программу, перемишивающая карты в колоде случаным образом.
"Раздайте" карты из перемешанной колоды трем игрокам и выведите полученные каждым игроком карты на экран.
"""
import random

cards = ["6 пика", "6 чирва", "6 бубна", "6 трефа",
         "7 пика", "7 чирва", "7 бубна", "7 трефа",
         "8 пика", "8 чирва", "8 бубна", "8 трефа",
         "9 пика", "9 чирва", "9 бубна", "9 трефа",
         "10 пика", "10 чирва", "10 бубна", "10 трефа",
         "Валет пика", "Валет чирва", "Валет бубна", "Валет трефа",
         "Дама пика", "Дама чирва", "дама бубна", "Дама трефа",
         "Король пика", "Король чирва", "Король бубна", "Король трефа",
         "Туз пика", "Туз чирва", "Туз бубна", "Туз трефа"]

random.shuffle(cards)

player1 = random.sample(cards, k=7)
for i in player1:
    if i in cards:
        cards.remove(i)

player2 = random.sample(cards, k=7)
for i in player2:
    if i in cards:
        cards.remove(i)

player3 = random.sample(cards, k=7)
for i in player3:
    if i in cards:
        cards.remove(i)

print("Карты игрока 1:", player1)
print("Карты игрока 2:", player2)
print("Карты игрока 3:", player3)
